from shedule import (
    _SHEDULE_DAY, 
    Subject, 
    WeekShedule, 
    WeekSheduleFactory, 
    DayShedule, 
    GroupShedule, 
    GroupSheduleFactory,
    UserInfo
)


monday_shedule = DayShedule(
    _SHEDULE_DAY.monday,
    [
        Subject('Математика', '8:00-9:30'),
        Subject('Английский', '9:40-11:10'),
        Subject('Физра', '11:40-13:10'),
        Subject('География', '13:30-15:10')
    ]
)

tue_shedule = DayShedule(
    _SHEDULE_DAY.tuesday,
    [
        Subject('Математика', '8:00-9:30'),
        Subject('Английский', '9:40-11:10'),
        Subject('Английский', '11:40-13:10'),
        Subject('География', '13:30-15:10')
    ]
)

week = WeekShedule(
    [
        monday_shedule,
        tue_shedule
    ]
)

userShedule = GroupShedule(
    UserInfo('ПИ-19.2', 'LMK'),
    week
)

print('Тест фабрик')

week_shed = {
    'Понедельник': {
        1: {
            'Предмет': 'Математика',
            'Время': '8:00-9:30'
        },
        2: {
            'Предмет': 'Английский',
            'Время': '11:00-9:30'
        },
        3: {
            'Предмет': 'Математика',
            'Время': '8:00-9:30'
        },
        4: {
            'Предмет': 'Математика',
            'Время': '8:00-9:30'
        },
    }, 
    'Вторник': {
        1: {
            'Предмет': 'Математика',
            'Время': '8:00-9:30'
        },
        2: {
            'Предмет': 'Математика',
            'Время': '12:00-9:30'
        },
        3: {
            'Предмет': 'Математика',
            'Время': '8:00-9:30'
        },
        4: {
            'Предмет': 'Математика',
            'Время': '8:00-9:30'
        },
    }
}

print('WeekSheduleFactory', WeekSheduleFactory(week_shed).get_week_shedule().dict())

print('Group Factory Test')

doc = {
    'Группа': 'ПИ-19.2',
    'Место': 'LMK',
    'Расписание': {
        'Понедельник': {
            1: {
                'Предмет': 'Математика',
                'Время': '8:00-9:30'
            },
            2: {
                'Предмет': 'Английский',
                'Время': '11:00-9:30'
            },
            3: {
                'Предмет': 'Математика',
                'Время': '8:00-9:30'
            },
            4: {
                'Предмет': 'Математика',
                'Время': '8:00-9:30'
            },
        }, 
        'Вторник': {
            1: {
                'Предмет': 'Математика',
                'Время': '8:00-9:30'
            },
            2: {
                'Предмет': 'Математика',
                'Время': '12:00-9:30'
            },
            3: {
                'Предмет': 'Математика',
                'Время': '8:00-9:30'
            },
            4: {
                'Предмет': 'Математика',
                'Время': '8:00-9:30'
            },
        }
    }
}

print(GroupSheduleFactory(doc).get_group_shedule().dict())